os2web_acadre_arp/test_data/request-19.soap.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Publish xmlns="http://Acadre.Publishing.CMS.PublishingHandler.Demo"><info><ItemId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">06d6f520-2fe6-41a0-b72a-d16f415e9bc8</ItemId><LocationId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">default</LocationId><Metadata xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">&lt;?xml version="1.0" encoding="utf-16"?&gt;
&lt;PublishedSupplementDocument xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.traen.com/2007/20/07/"&gt;
  &lt;AdministrativeUnit&gt;
    &lt;AdministrativeUnitGUID&gt;127f4700-88d7-48a0-b285-6d2271ec9694&lt;/AdministrativeUnitGUID&gt;
    &lt;AdministrativeUnitName&gt;Test enhed&lt;/AdministrativeUnitName&gt;
  &lt;/AdministrativeUnit&gt;
  &lt;SupplementSequenceNumber&gt;2&lt;/SupplementSequenceNumber&gt;
  &lt;Title&gt;Test Bilag&lt;/Title&gt;
  &lt;SupplementCode&gt;F&lt;/SupplementCode&gt;
  &lt;Status&gt;B&lt;/Status&gt;
  &lt;Category&gt;Besvarelse&lt;/Category&gt;
  &lt;SupplementLatestVersion&gt;
    &lt;VersionNumber&gt;1&lt;/VersionNumber&gt;
    &lt;FileReferenceId&gt;3345869&lt;/FileReferenceId&gt;
    &lt;FileReferenceVersionId&gt;1&lt;/FileReferenceVersionId&gt;
    &lt;Comment /&gt;
  &lt;/SupplementLatestVersion&gt;
  &lt;ResponsibleUser&gt;
    &lt;UserInitials&gt;acadre&lt;/UserInitials&gt;
    &lt;UserName&gt;acadre&lt;/UserName&gt;
  &lt;/ResponsibleUser&gt;
  &lt;IsPaperBased&gt;false&lt;/IsPaperBased&gt;
  &lt;JournalizationDate&gt;2012-07-31&lt;/JournalizationDate&gt;
&lt;/PublishedSupplementDocument&gt;</Metadata><PhysicalFileReference xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo"><FileName>Test Bilag.DOCX</FileName><ItemId>1635235</ItemId><Version>1</Version></PhysicalFileReference></info><parentItemId>06d6f520-2fe6-41a0-b72a-d16f415e9bc8</parentItemId></Publish></soap:Body></soap:Envelope>